build/war/classes/org/jboss/soa/esb/samples/quickstart/webservice_consumer2/soap_message_01.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:good="http://aes/Supplier">
   <soapenv:Header/>
   <soapenv:Body>
      <good:getBrands>
         <message>Goodbye!!</message>
      </good:getBrands>
   </soapenv:Body>
</soapenv:Envelope>